# hours = int(input("Введите количество часов (0-23): "))
# if 0 <= hours < 6:
#     print("спокойной ночи")
# elif hours < 13:
#     print("доброе утро")
# elif hours < 17:
#     print("хорошего тебе дня")
# elif hours < 24:
#     print("добрый вечер")
# else:
#     print("Неверный ввод Пожалуйста введите число от 0 до 23.")
# #    спокойной ночи с 0 до 6
# # доброе утро с 6 до 13
# # хорошего дня с 13 до 17
# # добрый вечер 13 до 24
# x = int(input(4))
# y = int(input(11))

# x = x % y
# x = x % y
# y = y % x

# print(y)


# z = y = x = 1
# print(x, y, z, sep="*")
