# 1 Задание
# start = int(input("Введите первое число: "))
# end = int(input("Введите второе число: "))

# if start > end:
#     start, end = end, start

# while start <= end:
#     print(start)
#     start += 1






# 2 Задание

# start = int(input("Введите первое число диапозона: "))
# end = int(input("Введите второе число диопазона: "))

# if start > end:
#     start, end = end, start

# if start % 2 == 0:
#     start += 1


# print("Нечётные числа в диапазоне от", start, "до", end, ":")
# while start <= end:
#     print(start)
#     start += 2












# 3 Задание
# start = int(input("Введите начало диапазона: "))
# end = int(input("Введите конец диапазона: "))

# if start > end:
#     start, end = end, start
# if start % 2 != 0:
#     start += 1

# while start <= end:
#     print(start)
# start += 2
# 4
# 6
# 8
# 10












# 4 задание
# start = int(input("Введите первое число: "))
# end = int(input("Введите второе число: "))

# if start > end:
#     start, end = end, start
# current = end

# while current >= start:
#     print(current)
#     current -= 1

# 10
# 9
# 8# 7
# 6
# 5
# 4
# 3













# 5 Задание
# start = int(input("Введите первое число: "))
# end = int(input("Вводите второе число: "))
# if start > end:
#     start, end = end, start
# if start % 2 == 0:
#     start += 1
# while start <= end:
#     print(start)
#     start += 2
